# Libraries

In [2]:
import sys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
print(pd.__version__)
print(np.version.version)
print(sys.version)

1.0.5
1.18.5
3.8.3 (default, Jul  2 2020, 11:26:31)
[Clang 10.0.0 ]

# Read Data

In [122]:
df_test = pd.read_csv("./Data/test.csv")
df_train = pd.read_csv("./Data/train.csv")

In [123]:
df_train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Compare Columns

In [127]:
# find different column
train_columns = pd.DataFrame({"Diff_Column": df_train.columns,
                            "train_data" : range(len(df_train.columns.tolist()))})

test_columns = pd.DataFrame({'Diff_Column': df_test.columns, 
                             'test_data': range(len(df_test.columns.tolist()))})

col_merged = pd.merge(train_columns, test_columns, on = 'Diff_Column', how = 'left') # compare by column name

a = col_merged[col_merged.isnull().any(axis = 1)]

diff_columns = []
for i in col_merged[col_merged.isnull().any(axis = 1)]['Diff_Column']:
    diff_columns.append(i)

In [128]:
# Change Column

re_index = list(df_test.columns)

for col in df_train.columns:
    if col in diff_columns :
        re_index.append(col)
        
df_train = df_train.reindex(columns = re_index)

In [131]:
df_train.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,0

In [132]:
train_info = pd.DataFrame(zip(df_train.columns, df_train.count(),df_train.nunique(), df_train.dtypes))
train_info.columns = ['Column', 'Count', 'Unique', 'Dtype']
test_info = pd.DataFrame(zip(df_test.columns, df_test.count(), df_test.nunique(), df_test.dtypes))
test_info.columns = ['Column', 'Count', 'Unique', 'Dtype']
pd.concat([train_info, test_info], axis = 1, join ='outer',
          keys = ['train info','test info'])#.reindex=[train_info.index]

     train info                          test info
         Column Count Unique    Dtype       Column  Count Unique    Dtype
0   PassengerId   891    891    int64  PassengerId  418.0  418.0    int64
1        Pclass   891      3    int64       Pclass  418.0    3.0    int64
2          Name   891    891   object         Name  418.0  418.0   object
3           Sex   891      2   object          Sex  418.0    2.0   object
4           Age   714     88  float64          Age  332.0   79.0  float64
5         SibSp   891      7    int64        SibSp  418.0    7.0    int64
6         Parch   891      7    int64        Parch  418.0    8.0    int64
7        Ticket   891    681   object       Ticket  418.0  363.0   object
8          Fare   891    248  float64         Fare  417.0  169.0  float64
9         Cabin   204    147   object        Cabin   91.0   76.0   object
10     Embarked   889      3   object     Embarked  418.0    3.0   object
11     Survived   891      2    int64          NaN    NaN    NaN      NaN

# Data Processing

### Missing Value

### Converting to Numeric Value